
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS-V15
  * azurerm_key_vault_secret.POSTGRES-USER-V15
  * azurerm_key_vault_secret.POSTGRES_DATABASE-V15
  * azurerm_key_vault_secret.POSTGRES_HOST-V15
  * azurerm_key_vault_secret.POSTGRES_PORT-V15
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_HOST
* Replace
  * module.db-v15.null_resource.set-user-permissions-additionaldbs[&#34;npa&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
        id                      = "https://em-npa-aat.vault.azure.net/secrets/npa-POSTGRES-PASS/4c643699852744efaa4f3c8dc961c762"
        name                    = "npa-POSTGRES-PASS"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-npa-aat/providers/Microsoft.KeyVault/vaults/em-npa-aat"
      + name                    = "npa-POSTGRES-PASS-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://em-npa-aat.vault.azure.net/secrets/npa-POSTGRES-USER/bc4fc9976f0c4b4abba1c52da2f5ab44"
        name                    = "npa-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-npa-aat/providers/Microsoft.KeyVault/vaults/em-npa-aat"
      + name                    = "npa-POSTGRES-USER-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-npa-aat/providers/Microsoft.KeyVault/vaults/em-npa-aat"
      + name                    = "npa-POSTGRES-DATABASE-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://em-npa-aat.vault.azure.net/secrets/npa-POSTGRES-HOST/b0be5dfd55c84e12bc653aa024c42d74"
        name                    = "npa-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-npa-aat/providers/Microsoft.KeyVault/vaults/em-npa-aat"
      + name                    = "npa-POSTGRES-HOST-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-npa-aat/providers/Microsoft.KeyVault/vaults/em-npa-aat"
      + name                    = "npa-POSTGRES-PORT-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.db-v15.null_resource.set-user-permissions-additionaldbs["npa"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "7266316408217479847" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "force_trigger"  = "1" -> ""
            # (3 unchanged elements hidden)
        }
    }

Plan: 6 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1800,"Program":"tfcmt","SHA1":"","Vars":{}} -->